cfd-simulation/trout/U_0p8/0/k
FoamFile
{
    version 2.0;
    format ascii;
    class volScalarField;
    object k;
}

dimensions [0 2 -2 0 0 0 0];

internalField uniform 0.00375;

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform 0.00375;
    }

    outlet
    {
        type zeroGradient;
    }

    bottom
    {
        type symmetry;
    }

    top
    {
        type symmetry;
    }

    sideMin
    {
        type symmetry;
    }

    sideMax
    {
        type symmetry;
    }

    fish
    {
        type kqRWallFunction;
        value uniform 0.00375;
    }
}
